UCB_CS61_lec31.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session 第三十一课 排序(二),快速排序
#+PROPERTY: header-args:ipython :session 第三十一课 排序(二),快速排序
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:nil ^:nil _:nil tags:not-in-toc
#+TITLE: 第三十一课 排序(二),快速排序
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


Quicksort is a _recursive divide-and-conquer_ algorithm, like mergesort.
Quicksort is in practice the _fastest_ known _comparison-based_ sort for arrays,
even though it has a Theta(n^2) worst-case running time. If properly designed,
however, it virtually always runs in O(n log n) time. On arrays, this asymptotic
bound hides a constant smaller than mergesort's, but mergesort is often slightly
faster for sorting linked lists.

Given an unsorted list I of items, quicksort chooses a "pivot" item v from I,
then puts each item of I into one of two unsorted lists, depending on whether
its key is less or greater than v's key. (Items whose keys are equal to v's key
can go into either list; we'll discuss this issue later.)

教授说，pivot 的选择太复杂，不在这里讨论

* Algorithm of quick sort                    :DivideAndConquer:InPlace:IandI:
a little likely to merge sort

  Start with the unsorted list I of n input items.
  Choose a pivot item v from I.
  Partition I into two unsorted lists I1 and I2.
    - I1 contains all items whose keys are smaller than v's key.
    - I2 contains all items whose keys are larger than v's.
    - Items with the same key as v can go into either list.
    - The pivot v, however, does not go into either list.
  Sort I1 recursively, yielding the sorted list S1.
  Sort I2 recursively, yielding the sorted list S2.
  Concatenate S1, v, and S2 together, yielding a sorted list S.
* Difference between QuickSort and MergeSort

#+NAME: difference between mergeSort and quickSort
#+BEGIN_SRC ditaa
                     MergeSort                       QuickSort
           / +--------------------------+      +----------------------------+
          |  |                          |      |                            |
          |  +-------/----------\-------+      +----/--------------\--------+
          |  +-----------+  +-----------+      +-------+  +-----------------+
  O(logn) <  |           |  |           |      |       |  |                 |
          |  +-/------\--+  +--/-----\--+      +-/---\-+  +-----/--------\--+
          |  +----+ +----+  +----+ +----+      +--+ +--+  +----------+ +----+
          |  |    | |    |  |    | |    |      |  | |  |  |          | |    |
           \ +----+ +----+  +----+ +----+      +--+ +--+  +---/----\-+ +----+
                                                          +------+ +-+
              \------------------------/                  |      | | |
                          v                               +-/--\-+ +-+
                         O(n)                             +-+ +--+
                                                          | | |  |
                                                          +-+ +--+
#+END_SRC

Recall that mergesort sorts n items in O(n log n) time because the recursion
tree has 1 + ceiling(log_2 n) levels, and each level involves O(n) time spent
merging lists.

Quicksort also spends linear time at each level (partitioning
the lists), but it is trickier to analyze because the recursion tree is not
perfectly balanced, and _some keys survive to deeper levels than others._

mergeSort 和 quickSort 看起来一样，其实大相径庭，简直就是相反的：
mergeSort 重合不重分，合完了排序才算完; 时间主要用在合上; 每一层都需要合并 n 个数值，合并每层都耗时相似 O(n)
quickSort 重分不重合，分完了排序就完了; 时间主要用在分上; 越往深层走, 这层需要排序(分割)的数列越少, 这层的耗时越少.

1. Divide:
   - mergeSort 从中间位置一分为二
   - quickSort 选择一个 pivot，分成 {>pivot} {<pivot} 两部分
   - quickSort 的 pivot 的选择策略很重要（已排序数组选第一个作为 pivot => O(n^2)）
2. Conquer:
   - mergeSort 重 merge，轻 divide
   - quickSort 重 divide，轻 merge
   - quickSort 似乎 divide 完就算排列完毕了
3. array vs linkedList
   - mergeSort 适合 linkedList
   - quickSort 适合 array
4. In-place:
   - mergeSort 要使用额外的 O(n) 空间，又不适合 array 实现，所以无法做到 in-place sort
   - quickSort 可以很好的适应 in-place sort,但是代码很 tricky。

* Running time
The recursion bottoms out at one-item and zero-item lists.  (Zero-item lists
can arise when the pivot is the smallest or largest item in its list.)

How long does quicksort take?

The answer is made apparent by examining several possible recursion trees. In
the illustrations below, the pivot v is always chosen to be the first item in
the list.

#+BEGIN_EXAMPLE
                  ---------------------------       ---------------------------
                  |4 | 7 | 1 | 5 | 9 | 3 | 0|       |0 | 1 | 3 | 4 | 5 | 7 | 9|
v = pivot         ---------------------------       ---------------------------
                       /       |       \           / |             \
:* = empty list   ----------- --- -----------     / --- -----------------------
                  |1 | 3 | 0| |4| |7 | 5 | 9|    *  |0| |1 | 3 | 4 | 5 | 7 | 9|
                I1----------- --- -----------I2     --- -----------------------
                   /   |   \   v   /   |   \         v / |           \
                  --- --- ---     --- --- ---         / --- -------------------
                  |0| |1| |3|     |5| |7| |9|        *  |1| |3 | 4 | 5 | 7 | 9|
                I1--- --- ---I2 I1--- --- ---I2         --- -------------------
                       v               v                 v / |         \
                                                          / --- ---------------
                   0   1   3   4   5   7   9             *  |3| |4 | 5 | 7 | 9|
                                                            --- ---------------
In the example at left, we get lucky, and the pivot          v / |       \
always turns out to be the item having the median key.        / --- -----------
Hence, each unsorted list is partitioned into two pieces     *  |4| |5 | 7 | 9|
of equal size, and we have a well-balanced recursion            --- -----------
tree.  Just like in mergesort, the tree has O(log n)             v / |     \
levels.  Partitioning a list is a linear-time operation,          / --- -------
so the total running time is O(n log n).                         *  |5| |7 | 9|
                                                                    --- -------
The example at right, on the other hand, shows the Theta(n^2)        v / |   \
performance we suffer if the pivot always proves to have the          / --- ---
smallest or largest key in the list.  (You can see it takes          *  |7| |9|
Omega(n^2) time because the first n/2 levels each process a list        --- ---
of length n/2 or greater.)  The recursion tree is as unbalanced          v
as it can be.  This example shows that when the input list I
happens to be already sorted, choosing the pivot to be the first item of the
list is a disastrous policy.
#+END_EXAMPLE

