UCB_CS61_lec31.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 20:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第三十一课 排序(二),快速排序</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第三十一课 排序(二),快速排序</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7155948">Algorithm of quick sort</a></li>
<li><a href="#orgd14675f">Difference between QuickSort and MergeSort</a></li>
<li><a href="#org28798f0">Running time</a></li>
<li><a href="#org229a4ba">Choosing a Pivot</a></li>
<li><a href="#orgce7bc84">Quicksort on Linked Lists</a></li>
<li><a href="#orge778894">Quicksort on Arrays : In-place</a></li>
<li><a href="#org8c2a372">Postscript</a></li>
<li><a href="#org8e330e7">Summary: lec 30~31 all the O(nlogn)</a></li>
</ul>
</div>
</div>
<p>
Quicksort is a <span class="underline">recursive divide-and-conquer</span> algorithm, like mergesort.
Quicksort is in practice the <span class="underline">fastest</span> known <span class="underline">comparison-based</span> sort for arrays,
even though it has a Theta(n^2) worst-case running time. If properly designed,
however, it virtually always runs in O(n log n) time. On arrays, this asymptotic
bound hides a constant smaller than mergesort's, but mergesort is often slightly
faster for sorting linked lists.
</p>

<p>
Given an unsorted list I of items, quicksort chooses a "pivot" item v from I,
then puts each item of I into one of two unsorted lists, depending on whether
its key is less or greater than v's key. (Items whose keys are equal to v's key
can go into either list; we'll discuss this issue later.)
</p>

<p>
教授说，pivot 的选择太复杂，不在这里讨论
</p>

<div id="org7155948" class="outline-2">
<h2 id="org7155948">Algorithm of quick sort&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DivideAndConquer">DivideAndConquer</span>&#xa0;<span class="InPlace">InPlace</span>&#xa0;<span class="IandI">IandI</span></span></h2>
<div class="outline-text-2" id="text-org7155948">
<p>
a little likely to merge sort
</p>

<p>
Start with the unsorted list I of n input items.
Choose a pivot item v from I.
Partition I into two unsorted lists I1 and I2.
</p>
<ul class="org-ul">
<li>I1 contains all items whose keys are smaller than v's key.</li>
<li>I2 contains all items whose keys are larger than v's.</li>
<li>Items with the same key as v can go into either list.</li>
<li>The pivot v, however, does not go into either list.</li>
</ul>
<p>
Sort I1 recursively, yielding the sorted list S1.
Sort I2 recursively, yielding the sorted list S2.
Concatenate S1, v, and S2 together, yielding a sorted list S.
</p>
</div>
</div>
<div id="orgd14675f" class="outline-2">
<h2 id="orgd14675f">Difference between QuickSort and MergeSort</h2>
<div class="outline-text-2" id="text-orgd14675f">
<p>
Recall that mergesort sorts n items in O(n log n) time because the recursion
tree has 1 + ceiling(log_2 n) levels, and each level involves O(n) time spent
merging lists.
</p>

<p>
Quicksort also spends linear time at each level (partitioning
the lists), but it is trickier to analyze because the recursion tree is not
perfectly balanced, and <span class="underline">some keys survive to deeper levels than others.</span>
</p>

<p>
mergeSort 和 quickSort 看起来一样，其实大相径庭，简直就是相反的：
mergeSort 重合不重分，合完了排序才算完; 时间主要用在合上; 每一层都需要合并 n 个数值，合并每层都耗时相似 O(n)
quickSort 重分不重合，分完了排序就完了; 时间主要用在分上; 越往深层走, 这层需要排序(分割)的数列越少, 这层的耗时越少.
</p>

<ol class="org-ol">
<li>Divide:
<ul class="org-ul">
<li>mergeSort 从中间位置一分为二</li>
<li>quickSort 选择一个 pivot，分成 {&gt;pivot} {&lt;pivot} 两部分</li>
<li>quickSort 的 pivot 的选择策略很重要（已排序数组选第一个作为 pivot =&gt; O(n^2)）</li>
</ul></li>
<li>Conquer:
<ul class="org-ul">
<li>mergeSort 重 merge，轻 divide</li>
<li>quickSort 重 divide，轻 merge</li>
<li>quickSort 似乎 divide 完就算排列完毕了</li>
</ul></li>
<li>array vs linkedList
<ul class="org-ul">
<li>mergeSort 适合 linkedList</li>
<li>quickSort 适合 array</li>
</ul></li>
<li>In-place:
<ul class="org-ul">
<li>mergeSort 要使用额外的 O(n) 空间，又不适合 array 实现，所以无法做到 in-place sort</li>
<li>quickSort 可以很好的适应 in-place sort,但是代码很 tricky。</li>
</ul></li>
</ol>
</div>
</div>

<div id="org28798f0" class="outline-2">
<h2 id="org28798f0">Running time</h2>
<div class="outline-text-2" id="text-org28798f0">
<p>
The recursion bottoms out at one-item and zero-item lists.  (Zero-item lists
can arise when the pivot is the smallest or largest item in its list.)
</p>

<p>
How long does quicksort take?
</p>

<p>
The answer is made apparent by examining several possible recursion trees. In
the illustrations below, the pivot v is always chosen to be the first item in
the list.
</p>

<pre class="example">
                  ---------------------------       ---------------------------
                  |4 | 7 | 1 | 5 | 9 | 3 | 0|       |0 | 1 | 3 | 4 | 5 | 7 | 9|
v = pivot         ---------------------------       ---------------------------
                       /       |       \           / |             \
:* = empty list   ----------- --- -----------     / --- -----------------------
                  |1 | 3 | 0| |4| |7 | 5 | 9|    *  |0| |1 | 3 | 4 | 5 | 7 | 9|
                I1----------- --- -----------I2     --- -----------------------
                   /   |   \   v   /   |   \         v / |           \
                  --- --- ---     --- --- ---         / --- -------------------
                  |0| |1| |3|     |5| |7| |9|        *  |1| |3 | 4 | 5 | 7 | 9|
                I1--- --- ---I2 I1--- --- ---I2         --- -------------------
                       v               v                 v / |         \
                                                          / --- ---------------
                   0   1   3   4   5   7   9             *  |3| |4 | 5 | 7 | 9|
                                                            --- ---------------
In the example at left, we get lucky, and the pivot          v / |       \
always turns out to be the item having the median key.        / --- -----------
Hence, each unsorted list is partitioned into two pieces     *  |4| |5 | 7 | 9|
of equal size, and we have a well-balanced recursion            --- -----------
tree.  Just like in mergesort, the tree has O(log n)             v / |     \
levels.  Partitioning a list is a linear-time operation,          / --- -------
so the total running time is O(n log n).                         *  |5| |7 | 9|
                                                                    --- -------
The example at right, on the other hand, shows the Theta(n^2)        v / |   \
performance we suffer if the pivot always proves to have the          / --- ---
smallest or largest key in the list.  (You can see it takes          *  |7| |9|
Omega(n^2) time because the first n/2 levels each process a list        --- ---
of length n/2 or greater.)  The recursion tree is as unbalanced          v
as it can be.  This example shows that when the input list I
happens to be already sorted, choosing the pivot to be the first item of the
list is a disastrous policy.
</pre>
</div>
</div>
