UCB_CS61_lec31.html

<div id="org229a4ba" class="outline-2">
<h2 id="org229a4ba">Choosing a Pivot</h2>
<div class="outline-text-2" id="text-org229a4ba">
<p>
We need a better way to choose a pivot. A respected, time-tested method is to
randomly select an item from I to serve as pivot. With a random pivot, we can
expect "on average" to obtain a 1/4 - 3/4 split; half the time we'll obtain a
worse split, half the time better. A little math (see Goodrich and Tamassia
Section 11.2.1) shows that the average running time of quicksort with random
pivots is in O(n log n). (We'll do the analysis late this semester in a lecture
on "Randomized analysis.")
</p>

<p>
An even better way to choose a pivot (when n is larger than 50 or so) is called
the "median-of-three" strategy. Select three random items from I, and then
choose the item having the middle key. With a lot of math, this strategy can be
shown to have a smaller constant (hidden in the O(n log n) notation) than the
one-random-item strategy.
</p>
</div>
</div>

<div id="orgce7bc84" class="outline-2">
<h2 id="orgce7bc84">Quicksort on Linked Lists&#xa0;&#xa0;&#xa0;<span class="tag"><span class="I1IvI2">I1IvI2</span>&#xa0;<span class="Stable">Stable</span></span></h2>
<div class="outline-text-2" id="text-orgce7bc84">
<pre class="example">
                                                    ---------------------------
I deliberately left unresolved the question of      |5 | 5 | 5 | 5 | 5 | 5 | 5|
what to do with items that have the same key as     ---------------------------
the pivot.  Suppose we put all the items having                /             |
the same key as v into the list I1.  If we try to   ----------------------- ---
sort a list in which every single item has the      |5 | 5 | 5 | 5 | 5 | 5| |5|
same key, then _every_ item will go into list I1,   ----------------------- ---
and quicksort will have quadratic running time!     I1                       v
(See illustration at right.)

对于用链表实现的 quickSort，把待排数列分成三个部分能更好的处理
pivot 重复数字的问题：I1, Iv, I2
                                                    ---------------------------
When sorting a linked list, a far better solution   |5 | 7 | 5 | 0 | 6 | 5 | 5|
is to partition I into _three_ unsorted lists I1,   ---------------------------
I2, and Iv.  Iv contains the pivot v and all the     /         |           \
other items with the same key.  We sort I1 and I2   --- --------------- -------
recursively, yielding S1 and S2.  Iv, of course,    |0| |5 | 5 | 5 | 5| |7 | 6|
does not need to be sorted.  Finally, we            --- --------------- -------
concatenate S1, Iv, and S2 to yield S.              I1   v     Iv            I2

</pre>

<p>
This strategy is quite fast if there are a large number of duplicate keys,
because the lists called "Iv" (at each level of the recursion tree) require no
further sorting or manipulation.
</p>

<p>
Unfortunately, with linked lists, selecting a pivot is annoying. With an array,
we can read a randomly chosen pivot in constant time; with a linked list we must
walk half-way through the list on average, increasing the constant in our
running time. However, if we restrict ourselves to pivots near the beginning of
the linked list, we risk quadratic running time (for instance, if I is already
in sorted order, or nearly so), so we have to pay the price. (If you are clever,
you can speed up your implementation by choosing random pivots during the
partitioning step for the <span class="underline">next</span> round of partitioning.)
</p>
</div>
</div>
