UCB_CS61_lec31.org
* Quicksort on Arrays : In-place                                      :I1vI2:
数组实现的 quickSort，还是把待排数列分成两部分：I1,I2

Quicksort shines for sorting arrays.  In-place quicksort is very fast.  But
a fast in-place quicksort is tricky to code.  It's easy to write a buggy or
quadratic version by mistake.  Goodrich and Tamassia did.

Suppose we have an array a in which we want to sort the items starting at
a[low] and ending at a[high].  We choose a pivot v and move it out of the way
by swapping it with the last item, a[high].

We employ two array indices, i and j.  i is initially "low - 1", and j is
initially "high", so that i and j sandwich the items to be sorted (not
including the pivot).  We will enforce the following invariants.
  - All items at or left of index i have a key <= the pivot's key.
  - All items at or right of index j have a key >= the pivot's key.

#+BEGIN_EXAMPLE
To partition the array, we advance the index        ---------------------------
i until it encounters an item whose key is          |3 | 8 | 0 | 9 | 5 | 7 | 4|
greater than or equal to the pivot's key; then      ---------------------------
we decrement the index j until it encounters        low              v     high
an item whose key is less than or equal to
the pivot's key.  Then, we swap the items at        ---------------------------
i and j.  We repeat this sequence until the         |3 | 8 | 0 | 9 | 4 | 7 | 5|
indices i and j meet in the middle.  Then,          ---------------------------
we move the pivot back into the middle (by        ^                          ^
swapping it with the item at index i).            i                          j

An example is given at right.  The randomly         ---------------------------
selected pivot, whose key is 5, is moved to         |3 | 8 | 0 | 9 | 4 | 7 | 5|
the end of the array by swapping it with the        ---------------------------
last item.  The indices i and j are created.   advance:  i           j
i advances until it reaches an item whose key
is >= 5, and j retreats until it reaches an         ---------------------------
item whose key is <= 5.  The two items are          |3 | 4 | 0 | 9 | 8 | 7 | 5|
swapped, and i advances and j retreats again.       ---------------------------
After the second advance/retreat, i and j      swap:     i           j
have crossed paths, so we do not swap their
items.  Instead, we swap the pivot with the         ---------------------------
item at index i, putting it between the lists       |3 | 4 | 0 | 9 | 8 | 7 | 5|
I1 and I2 where it belongs.                         ---------------------------
                                               advance:      j   i
What about items having the same key as the
pivot?  Handling these is particularly              ----------- --- -----------
tricky.  We'd like to put them on a separate        |3 | 4 | 0| |5| |8 | 7 | 9|
list (as we did for linked lists), but doing        ----------- --- -----------
that in place is too complicated.  As I noted       I1           i           I2
previously, if we put all these items into
the list I1, we'll have quadratic running time when all the keys in the array
are equal, so we don't want to do that either.

    #+END_EXAMPLE

The solution is to make sure each index, i and j, stops whenever it reaches a
key equal to the pivot.  Every key equal to the pivot (except perhaps one, if
we end with i = j) takes part in one swap.  Swapping an item equal to the pivot
may seem unnecessary, but it has an excellent side effect:  if all the items in
the array have the same key, half these items will go into I1, and half into
I2, giving us a well-balanced recursion tree.  (To see why, try running the
pseudocode below on paper with an array of equal keys.)  WARNING:  The code on
page 530 of Goodrich and Tamassia gets this WRONG.  Their implementation has
quadratic running time when all the keys are equal.

#+NAME: QuickSortOnArray
#+BEGIN_SRC java
public static void quicksort(Comparable[] a, int low, int high) {
  // If there's fewer than two items, do nothing.
  // this is the base case of recursion
  if (low < high) {
    int pivotIndex = random number from low to high;
    Comparable pivot = a[pivotIndex];              //\
    a[pivotIndex] = a[high];                       // |-> Swap pivot with last item
    a[high] = pivot;                               ///

    int i = low - 1;                                              (ref:i and j)
    int j = high;
    // this do while loop is 紧凑且干净，important for fast
    do {
      do { i++; } while (a[i].compareTo(pivot) < 0);               // i 逐渐增加，当 i=high 时，while 语句会=0.
      do { j--; } while ((a[j].compareTo(pivot) > 0) && (j > low));// 但是 j--没有这个保证，所以需要加上>low
                                                                   // 另外，这两个 do-while 很经典，因为这样做
                                                                   // 就避免了用 if 语句去检测是否与 pivot 相等的操作
                                                                   // 如果不等就不做交换，这个操作。如果一开始就把
                                                                   // 判等语句放在前面，会比较慢
      if (i < j) {
        swap a[i] and a[j];
      }
    } while (i < j);

    a[high] = a[i];
    a[i] = pivot;                   // Put pivot in the middle where it belongs
    quicksort(a, low, i - 1);                     // Recursively sort left list
    quicksort(a, i + 1, high);                   // Recursively sort right list
  }
}
#+END_SRC

Can the "do { i++ }" loop walk off the end of the array and generate an out-of-
bounds exception? No, because a[high] contains the pivot, so i will stop
advancing when i == high (if not sooner). There is no such assurance for j,
though, so the "do { j-- }" loop explicitly tests whether "j > low" before
retreating.

