UCB_CS61_lec31.html
<div id="orge778894" class="outline-2">
<h2 id="orge778894">Quicksort on Arrays : In-place&#xa0;&#xa0;&#xa0;<span class="tag"><span class="I1vI2">I1vI2</span></span></h2>
<div class="outline-text-2" id="text-orge778894">
<p>
数组实现的 quickSort，还是把待排数列分成两部分：I1,I2
</p>

<p>
Quicksort shines for sorting arrays.  In-place quicksort is very fast.  But
a fast in-place quicksort is tricky to code.  It's easy to write a buggy or
quadratic version by mistake.  Goodrich and Tamassia did.
</p>

<p>
Suppose we have an array a in which we want to sort the items starting at
a[low] and ending at a[high].  We choose a pivot v and move it out of the way
by swapping it with the last item, a[high].
</p>

<p>
We employ two array indices, i and j.  i is initially "low - 1", and j is
initially "high", so that i and j sandwich the items to be sorted (not
including the pivot).  We will enforce the following invariants.
</p>
<ul class="org-ul">
<li>All items at or left of index i have a key &lt;= the pivot's key.</li>
<li>All items at or right of index j have a key &gt;= the pivot's key.</li>
</ul>

<pre class="example">
To partition the array, we advance the index        ---------------------------
i until it encounters an item whose key is          |3 | 8 | 0 | 9 | 5 | 7 | 4|
greater than or equal to the pivot's key; then      ---------------------------
we decrement the index j until it encounters        low              v     high
an item whose key is less than or equal to
the pivot's key.  Then, we swap the items at        ---------------------------
i and j.  We repeat this sequence until the         |3 | 8 | 0 | 9 | 4 | 7 | 5|
indices i and j meet in the middle.  Then,          ---------------------------
we move the pivot back into the middle (by        ^                          ^
swapping it with the item at index i).            i                          j

An example is given at right.  The randomly         ---------------------------
selected pivot, whose key is 5, is moved to         |3 | 8 | 0 | 9 | 4 | 7 | 5|
the end of the array by swapping it with the        ---------------------------
last item.  The indices i and j are created.   advance:  i           j
i advances until it reaches an item whose key
is &gt;= 5, and j retreats until it reaches an         ---------------------------
item whose key is &lt;= 5.  The two items are          |3 | 4 | 0 | 9 | 8 | 7 | 5|
swapped, and i advances and j retreats again.       ---------------------------
After the second advance/retreat, i and j      swap:     i           j
have crossed paths, so we do not swap their
items.  Instead, we swap the pivot with the         ---------------------------
item at index i, putting it between the lists       |3 | 4 | 0 | 9 | 8 | 7 | 5|
I1 and I2 where it belongs.                         ---------------------------
                                               advance:      j   i
What about items having the same key as the
pivot?  Handling these is particularly              ----------- --- -----------
tricky.  We'd like to put them on a separate        |3 | 4 | 0| |5| |8 | 7 | 9|
list (as we did for linked lists), but doing        ----------- --- -----------
that in place is too complicated.  As I noted       I1           i           I2
previously, if we put all these items into
the list I1, we'll have quadratic running time when all the keys in the array
are equal, so we don't want to do that either.

</pre>

<p>
The solution is to make sure each index, i and j, stops whenever it reaches a
key equal to the pivot.  Every key equal to the pivot (except perhaps one, if
we end with i = j) takes part in one swap.  Swapping an item equal to the pivot
may seem unnecessary, but it has an excellent side effect:  if all the items in
the array have the same key, half these items will go into I1, and half into
I2, giving us a well-balanced recursion tree.  (To see why, try running the
pseudocode below on paper with an array of equal keys.)  WARNING:  The code on
page 530 of Goodrich and Tamassia gets this WRONG.  Their implementation has
quadratic running time when all the keys are equal.
</p>

<div class="org-src-container">
<pre class="src src-java" id="orgb48a3d5"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">quicksort</span>(<span style="color: #ce537a; font-weight: bold;">Comparable</span>[] <span style="color: #7590db;">a</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">low</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">high</span>) {
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">If there's fewer than two items, do nothing.</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">this is the base case of recursion</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> (low &lt; <span style="color: #ce537a; font-weight: bold;">high</span>) {
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">pivotIndex</span> = random number from low to high;
    <span style="color: #ce537a; font-weight: bold;">Comparable</span> <span style="color: #7590db;">pivot</span> = a[pivotIndex];              <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">\</span>
    a[pivotIndex] = a[high];                       <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">|-&gt; Swap pivot with last item</span>
    a[high] = pivot;                               <span style="color: #2aa1ae; background-color: #292e34;">///</span>

<span id="coderef-i and j" class="coderef-off">    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = low - <span style="color: #a45bad;">1</span>; (i and j)</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = high;
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">this do while loop is &#32039;&#20945;&#19988;&#24178;&#20928;&#65292;important for fast</span>
    <span style="color: #4f97d7; font-weight: bold;">do</span> {
      <span style="color: #4f97d7; font-weight: bold;">do</span> { i++; } <span style="color: #4f97d7; font-weight: bold;">while</span> (a[i].compareTo(pivot) &lt; <span style="color: #a45bad;">0</span>);               <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">i &#36880;&#28176;&#22686;&#21152;&#65292;&#24403; i=high &#26102;&#65292;while &#35821;&#21477;&#20250;=0.</span>
      <span style="color: #4f97d7; font-weight: bold;">do</span> { j--; } <span style="color: #4f97d7; font-weight: bold;">while</span> ((a[j].compareTo(pivot) &gt; <span style="color: #a45bad;">0</span>) &amp;&amp; (j &gt; low));<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20294;&#26159; j--&#27809;&#26377;&#36825;&#20010;&#20445;&#35777;&#65292;&#25152;&#20197;&#38656;&#35201;&#21152;&#19978;&gt;low</span>
                                                                   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#21478;&#22806;&#65292;&#36825;&#20004;&#20010; do-while &#24456;&#32463;&#20856;&#65292;&#22240;&#20026;&#36825;&#26679;&#20570;</span>
                                                                   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#23601;&#36991;&#20813;&#20102;&#29992; if &#35821;&#21477;&#21435;&#26816;&#27979;&#26159;&#21542;&#19982; pivot &#30456;&#31561;&#30340;&#25805;&#20316;</span>
                                                                   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#19981;&#31561;&#23601;&#19981;&#20570;&#20132;&#25442;&#65292;&#36825;&#20010;&#25805;&#20316;&#12290;&#22914;&#26524;&#19968;&#24320;&#22987;&#23601;&#25226;</span>
                                                                   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#21028;&#31561;&#35821;&#21477;&#25918;&#22312;&#21069;&#38754;&#65292;&#20250;&#27604;&#36739;&#24930;</span>
      <span style="color: #4f97d7; font-weight: bold;">if</span> (i &lt; <span style="color: #ce537a; font-weight: bold;">j</span>) {
        <span style="color: #ce537a; font-weight: bold;">swap</span> <span style="color: #7590db;">a</span>[i] and a[j];
      }
    } <span style="color: #4f97d7; font-weight: bold;">while</span> (i &lt; <span style="color: #ce537a; font-weight: bold;">j</span>);

    a[high] = a[i];
    a[i] = pivot;                   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Put pivot in the middle where it belongs</span>
    quicksort(a, low, i - <span style="color: #a45bad;">1</span>);                     <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Recursively sort left list</span>
    quicksort(a, i + <span style="color: #a45bad;">1</span>, high);                   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Recursively sort right list</span>
  }
}
</pre>
</div>

<p>
Can the "do { i++ }" loop walk off the end of the array and generate an out-of-
bounds exception? No, because a[high] contains the pivot, so i will stop
advancing when i == high (if not sooner). There is no such assurance for j,
though, so the "do { j&#x2013; }" loop explicitly tests whether "j &gt; low" before
retreating.
</p>
</div>
</div>
