UCB_CS61_lec31.org
* Postscript
The journal "Computing in Science & Engineering" did a poll of experts to make a
list of the ten most important and influential algorithms of the twentieth
century, and it published a separate article on each of the ten algorithms.
Quicksort is one of the ten, and it is surely the simplest algorithm on the
list. Quicksort's inventor, Sir C. A. R. "Tony" Hoare, received the ACM Turing
Award in 1980 for his work on programming languages, and was conferred the title
of Knight Bachelor in March 2000 by Queen Elizabeth II for his contributions to
"Computing Science."
* Summary: lec 30~31 all the O(nlogn)
  | algo                                             | running-time |   |   |
  |--------------------------------------------------+--------------+---+---|
  | Insertion Sort (whose S is balanced search tree) | nlogn        |   |   |
  | Heap Sort( a selection sort whose 'I' is a Heap) | nlogn        |   |   |
