UCB_CS61_lec31.html

<div id="org8c2a372" class="outline-2">
<h2 id="org8c2a372">Postscript</h2>
<div class="outline-text-2" id="text-org8c2a372">
<p>
The journal "Computing in Science &amp; Engineering" did a poll of experts to make a
list of the ten most important and influential algorithms of the twentieth
century, and it published a separate article on each of the ten algorithms.
Quicksort is one of the ten, and it is surely the simplest algorithm on the
list. Quicksort's inventor, Sir C. A. R. "Tony" Hoare, received the ACM Turing
Award in 1980 for his work on programming languages, and was conferred the title
of Knight Bachelor in March 2000 by Queen Elizabeth II for his contributions to
"Computing Science."
</p>
</div>
</div>
<div id="org8e330e7" class="outline-2">
<h2 id="org8e330e7">Summary: lec 30~31 all the O(nlogn)</h2>
<div class="outline-text-2" id="text-org8e330e7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">algo</th>
<th scope="col" class="org-left">running-time</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Insertion Sort (whose S is balanced search tree)</td>
<td class="org-left">nlogn</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Heap Sort( a selection sort whose 'I' is a Heap)</td>
<td class="org-left">nlogn</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
